Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/svd/PIC32CZ4010CA90100.svd
            <register>
               <name>HCBR1</name>
               <description>HBI Channel Busy 1 Register</description>
               <addressOffset>0x49C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHB</name>
                     <description>Bitwise channel busy bit: 0 = idle, 1 = busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDAT0</name>
               <description>MIF Data 0 Register</description>
               <addressOffset>0x4C0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>CTR data - bits[31:0] of 128-bit entry or DBR data - bits[7:0] of 8-bit entry</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDAT1</name>
               <description>MIF Data 1 Register</description>
               <addressOffset>0x4C4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>CTR data - bits[63:32] of 128-bit entry</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDAT2</name>
               <description>MIF Data 2 Register</description>
               <addressOffset>0x4C8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>CTR data - bits[95:64] of 128-bit entry</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDAT3</name>
               <description>MIF Data 3 Register</description>
               <addressOffset>0x4CC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>CTR data - bits[127:96] of 128-bit entry</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDWE0</name>
               <description>MIF Data Write Enable 0 Register</description>
               <addressOffset>0x4D0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>Bitwise write enable for CTR data - bits[31:0] (0 = disabled, 1 = enabled)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDWE1</name>
               <description>MIF Data Write Enable 1 Register</description>
               <addressOffset>0x4D4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>Bitwise write enable for CTR data - bits[63:32] (0 = disabled, 1 = enabled)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDWE2</name>
               <description>MIF Data Write Enable 2 Register</description>
               <addressOffset>0x4D8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>Bitwise write enable for CTR data - bits[95:64] (0 = disabled, 1 = enabled)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDWE3</name>
               <description>MIF Data Write Enable 3 Register</description>
               <addressOffset>0x4DC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>Bitwise write enable for CTR data - bits[127:96] (0 = disabled, 1 = enabled)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCTL</name>
               <description>MIF Control Register</description>
               <addressOffset>0x4E0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XCMP</name>
                     <description>Transfer complete (write 0 to clear)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MADR</name>
               <description>MIF Address Register</description>
               <addressOffset>0x4E4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>DBR address of 8-bit entry - bits[13:8].CTR address of 128-bit entry or DBR address of 8-bit entry - bits[7:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>TB</name>
                     <description>Target location bit (0 = selects CTR, 1 = selects DBR)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WNR</name>
                     <description>Write-Not-Read selection (0 = read, 1 = write)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACTL</name>
               <description>AHB Control Register</description>
               <addressOffset>0x7C0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCE</name>
                     <description>Software clear enable: 0 = Hardware clears interrupt after a ACSRn register read 1 = Software clears interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMX</name>
                     <description>AHB interrupt mux enable: 0 = ACSR0 generates an interrupt on ahb_int[0]; ACSR1 generates an interrupt on ahb_int[1] 1 = ACSR0 and ACSR1 generate an interrupts on ahb_int[0] only</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAMODE</name>
                     <description>DMA Mode: 0 = DMA Mode 0 1 = DMA Mode 1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MPB</name>
                     <description>Packet buffering mode: 0 = single-packet mode 1 = multiple-packet mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACSR0</name>
               <description>AHB Channel Status 0 Register</description>
               <addressOffset>0x7D0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHS</name>
                     <description>Interrupt status for logical channels 31 to 0: 0 = None 1 = Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACSR1</name>
               <description>AHB Channel Status 1 Register</description>
               <addressOffset>0x7D4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHS</name>
                     <description>Interrupt status for logical channels 63 to 32: 0 = None 1 = Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACMR0</name>
               <description>AHB Channel Mask 0 Register</description>
               <addressOffset>0x7D8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHM</name>
                     <description>Bitwise channel mask bit:0 = Masked 1 = Unmasked</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACMR1</name>
               <description>AHB Channel Mask 1 Register</description>
               <addressOffset>0x7DC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHM</name>
                     <description>Bitwise channel mask bit:0 = Masked 1 = Unmasked</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
